InformationRegisters/ОчередьМаршрутизацииКомплексныхПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОчередьМаршрутизацииКомплексныхПроцессов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОжидания</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КомплексныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.КомплексныйПроцесс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗавершившеесяДействие</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередьМаршрутизацииКомплексныхПроцессов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.КоличествоПопытокОбработки = 0 Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаБезОшибок;
		
	Иначе
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОшибка;
		
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(НСтр("ru = 'При фоновой маршрутизации процесса '; en = 'During background process routing '"));
		МассивСтрок.Добавить(
			Новый ФорматированнаяСтрока(""""
				+ Строка(Запись.КомплексныйПроцесс)
				+ """",,,, ПолучитьНавигационнуюСсылку(Запись.КомплексныйПроцесс)));
		МассивСтрок.Добавить(НСтр("ru = ' после завершения действия '; en = ' upon completion of action '"));
		
		Если ЗначениеЗаполнено(Запись.ЗавершившеесяДействие) Тогда
			МассивСтрок.Добавить(
				Новый ФорматированнаяСтрока(""""
					+ Строка(Запись.ЗавершившеесяДействие)
					+ """",,,,ПолучитьНавигационнуюСсылку(Запись.ЗавершившеесяДействие)));
		КонецЕсли;
		
		МассивСтрок.Добавить(НСтр("ru = ' произошла ошибка:
			|
			|'; en = ' an error occurred:'"));
			
		МассивСтрок.Добавить(Запись.ТекстОшибки);
		
		Элементы.ДекорацияКомментарий.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
		
	КонецЕсли;
	
	Элементы.ФормаПродолжитьВыполнениеПроцессов.Видимость = Запись.КоличествоПопытокОбработки > 0;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьВыполнениеПроцессов(Команда)
	
	КомплексныеПроцессы = Новый Массив;
	
	ОписаниеПроцесса = Новый Структура("КомплексныйПроцесс, ЗавершившеесяДействие");
	ЗаполнитьЗначенияСвойств(ОписаниеПроцесса, Запись);
	
	КомплексныеПроцессы.Добавить(ОписаниеПроцесса);
	
	ПродолжитьВыполнениеПроцессовНаСервере(КомплексныеПроцессы);
	
	ОповеститьОбИзменении(Запись.ИсходныйКлючЗаписи);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПродолжитьВыполнениеПроцессовНаСервере(КомплексныеПроцессы)
	
	РегистрыСведений.ОчередьМаршрутизацииКомплексныхПроцессов.
		ПродолжитьВыполнениеПроцессов(КомплексныеПроцессы);
	
КонецПроцедуры

#КонецОбласти
